In [2]:
import pandas as pd

In [3]:
df = pd.read_csv(r"C:\Users\chiin\OneDrive\Escritorio\global_gpd\data\gdp_data.csv")

df.head()

  country_name country_code  year        value
0  Afghanistan          AFG  1960  537777811.1
1  Afghanistan          AFG  1961  548888895.6
2  Afghanistan          AFG  1962  546666677.8
3  Afghanistan          AFG  1963  751111191.1
4  Afghanistan          AFG  1964  800000044.4

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13365 entries, 0 to 13364
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   country_name  13365 non-null  object
 1   country_code  13365 non-null  object
 2   year          13365 non-null  int64
 3   value         13365 non-null  float64
dtypes: float64(1), int64(1), object(2)
memory usage: 417.8+ KB

In [5]:
df1 = pd.read_csv(r"C:\Users\chiin\OneDrive\Escritorio\global_gpd\data\country_codes.csv")

df1.head()

  country_code                     region         income_group
0          ABW  Latin America & Caribbean          High income
1          AFG                 South Asia           Low income
2          AGO         Sub-Saharan Africa  Lower middle income
3          ALB      Europe & Central Asia  Upper middle income
4          AND      Europe & Central Asia          High income

In [6]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 217 entries, 0 to 216
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   country_code  217 non-null    object
 1   region        217 non-null    object
 2   income_group  217 non-null    object
dtypes: object(3)
memory usage: 5.2+ KB

In [8]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
year,13365.0,1.994479e+03,1.745958e+01,1960.000,1.980000e+03,1.996000e+03,2.009000e+03,2.022000e+03
value,13365.0,1.207051e+12,5.413230e+12,8824746.238,2.523472e+09,1.842778e+10,2.240000e+11,1.010000e+14

In [9]:
df1.describe().T

             count unique                    top freq
country_code   217    217                    ABW    1
region         217      7  Europe & Central Asia   58
income_group   217      4            High income   82